tests/load/artillery.yml
config:
  target: "http://localhost:5000"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up to 50 users"
    
    # Sustained load
    - duration: 300
      arrivalRate: 50
      name: "Sustained load (50 concurrent users)"
    
    # Spike test
    - duration: 60
      arrivalRate: 100
      name: "Spike to 100 users"
    
    # Cool-down
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"
  
  processor: "./load-test-processor.cjs"
  
  # Variables
  variables:
    testEmail: "loadtest+{{ $randomNumber() }}@example.com"
    testPassword: "TestPassword123!"
  
  # Plugins
  plugins:
    expect: {}
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "Complete User Journey"
    weight: 60
    flow:
      # 1. Sign up / Login
      - post:
          url: "/api/auth/signup"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      
      # 2. Create session
      - post:
          url: "/api/sessions"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "Load Test Session {{ $randomNumber() }}"
          capture:
            - json: "$.session.id"
              as: "sessionId"
          expect:
            - statusCode: 201
      
      # 3. Generate content (simulate full generation)
      - post:
          url: "/api/sessions/{{ sessionId }}/generate"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            userInputs:
              topic: "AI productivity tips"
              targetAudience: "Entrepreneurs"
              platform: "tiktok"
          expect:
            - statusCode: 200
      
      # 4. Edit content
      - post:
          url: "/api/sessions/{{ sessionId }}/edit"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            editMessage: "Make the hook more engaging"
          expect:
            - statusCode: 200
      
      # 5. Get recent sessions
      - get:
          url: "/api/sessions/recent?limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      # Think time between actions (realistic user behavior)
      - think: 3

  - name: "Read-Heavy User"
    weight: 30
    flow:
      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # Browse sessions multiple times
      - loop:
          - get:
              url: "/api/sessions/recent"
              headers:
                Authorization: "Bearer {{ authToken }}"
          - think: 2
        count: 5

  - name: "Admin Operations"
    weight: 10
    flow:
      # Admin login (use actual admin credentials)
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@example.com"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.token"
              as: "adminToken"
      
      # Get all users
      - get:
          url: "/api/admin/users"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200
      
      # Get metrics
      - get:
          url: "/api/admin/metrics"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200
      
      # Get cost data
      - get:
          url: "/api/admin/costs?days=7"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200